cask_args appdir: '/Applications'

tap 'zaratan/arkham'
tap 'zaratan/bat-tools'

# Shell & terminal
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
brew 'tmux'
brew 'stow'
brew 'coreutils'
brew 'direnv'
brew 'fzf'

# CLI de base
brew 'bat'
brew 'curl'
brew 'duf'
brew 'dust'
brew 'fd'
brew 'htop'
brew 'jq'
brew 'moor'
brew 'ripgrep'
brew 'tldr'
brew 'tree'
brew 'wget'

# Git
brew 'git'
brew 'git-delta'
brew 'git-lfs'
brew 'gh'
brew 'tig'

# Dev — langages & gestionnaires
brew 'asdf'
brew 'go'
brew 'lua'
brew 'luajit'
brew 'luarocks'
brew 'perl'
brew 'pnpm'
brew 'python'
brew 'ruby'
brew 'rustup'
brew 'rust-analyzer'
brew 'cargo-binstall'
brew 'uv'
brew 'yarn'
brew 'wasm-pack'

# Dev — outils
brew 'cmake'
brew 'neovim'
brew 'prettierd'
brew 'stylua'
brew 'tree-sitter'
brew 'tree-sitter-cli'
brew 'rbspy'
brew 'httpie'

# Bases de données
brew 'postgresql@17'
brew 'redis'
brew 'sqlite'

# Cloud & déploiement
brew 'azure-cli'
brew 'railway'
brew 'scalingo'
brew 'vercel-cli'

# Réseau & transfert
brew 'axel'
brew 'magic-wormhole'
brew 'mosh'

# Média & documents
brew 'ffmpeg'
brew 'imagemagick'
brew 'sox'
brew 'texlive'
brew 'vips'

# Divers
brew 'base64'
brew 'gnupg'
brew 'openssl'
brew 'readline'
brew 'shpotify'
brew 'chiro'

# Apps — quotidien
cask 'alfred'
cask 'ghostty'
cask 'obsidian'
cask 'stats'
cask 'karabiner-elements'
cask 'gpg-suite'
cask 'google-drive'

# Apps — navigateurs
cask 'brave-browser'
cask 'firefox'
cask 'firefox@developer-edition'
cask 'google-chrome'
cask 'opera'
cask 'vivaldi'

# Apps — communication
cask 'discord'
cask 'hey-desktop'
cask 'microsoft-teams'
cask 'signal'
cask 'slack'
cask 'zoom'

# Apps — dev
# claude-code : installé via l'installeur officiel (voir install/setup)
cask 'claude'
cask 'insomnia'
cask 'orbstack'

# Apps — jeux & hobby
cask 'nvidia-geforce-now'
cask 'shoggoth'
cask 'spotify'
cask 'steam'
cask 'strange-eons'
cask 'teensy-profiles-editor'

# Fonts
cask 'font-geist-mono'
