cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'asdf'
brew 'awscli'
brew 'axel'
brew 'azure-cli'
brew 'base64'
brew 'bat'
brew 'calc'
brew 'cmake'
brew 'coreutils'
brew 'curl'
brew 'direnv'
brew 'duf'
brew 'dust'
brew 'fd'
brew 'ffmpeg'
brew 'figlet'
brew 'flac'
brew 'fzf'
brew 'git'
brew 'git-delta'
brew 'git-lfs'
brew 'gh'
brew 'go'
brew 'gnupg'
brew 'heroku'
brew 'htop'
brew 'httpie'
brew 'imagemagick'
brew 'jq'
brew 'lua'
brew 'luajit'
brew 'luarocks'
brew 'magic-wormhole'
brew 'mas'
brew 'moar'
brew 'mono'
brew 'moor'
brew 'mosh'
brew 'neovim'
brew 'nmap'
brew 'node'
brew 'openssl'
brew 'perl'
brew 'pnpm'
brew 'postgresql@15'
brew 'prettierd'
brew 'pyenv'
brew 'python'
brew 'reattach-to-user-namespace'
brew 'readline'
brew 'redis'
brew 'rbspy'
brew 'ripgrep'
brew 'ruby'
brew 'rust-analyzer'
brew 'scalingo'
brew 'shpotify'
brew 'sqlite'
brew 'stylua'
brew 'texlive'
brew 'thefuck'
brew 'tig'
brew 'tldr'
brew 'tmux'
brew 'tree'
brew 'tree-sitter'
brew 'v8'
brew 'vercel-cli'
brew 'vim'
brew 'vips'
brew 'viu'
brew 'wget'
brew 'yarn'
brew 'zsh'
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'

cask '1password'
cask 'alfred'
cask 'bettertouchtool'
cask 'brave-browser'
cask 'claude'
cask 'claude-code'
cask 'discord'
cask 'firefox@developer-edition'
cask 'google-drive'
cask 'gpg-suite'
cask 'hey-desktop'
cask 'insomnia'
cask 'kitty'
cask 'opera'
cask 'orbstack'
cask 'signal'
cask 'slack'
cask 'spotify'
cask 'stats'
cask 'steam'
cask 'visual-studio-code'
cask 'vivaldi'
cask 'zoom'
