cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'awscli'
brew 'axel'
brew 'base64'
brew 'bat'
brew 'cmake'
brew 'coreutils'
brew 'curl'
brew 'direnv'
brew 'duf'
brew 'dust'
brew 'fd'
brew 'ffmpeg'
brew 'figlet'
brew 'flac'
brew 'fzf'
brew 'git'
brew 'git-delta'
brew 'gh'
brew 'go'
brew 'gpg'
brew 'htop'
brew 'httpie'
brew 'jq'
brew 'magic-wormhole'
brew 'mas'
brew 'moar'
brew 'mono'
brew 'neovim'
brew 'nmap'
brew 'node'
brew 'openssl'
brew 'perl'
brew 'postgresql'
brew 'pyenv'
brew 'python'
brew 'reattach-to-user-namespace'
brew 'readline'
brew 'redis'
brew 'rbspy'
brew 'ruby'
brew 'scalingo'
brew 'sqlite'
brew 'thefuck'
brew 'the_silver_searcher'
brew 'tig'
brew 'tldr'
brew 'tmux'
brew 'tree'
brew 'utf8proc'
brew 'v8'
brew 'vault'
brew 'vim'
brew 'wget'
brew 'xz'
brew 'yarn'
brew 'zsh'
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'

cask '1password'
cask 'alfred'
cask 'basecamp'
cask 'bettertouchtool'
cask 'brave-browser'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'firefox@developer-edition'
cask 'hey'
cask 'gpg-suite'
cask 'insomnia'
cask 'iterm2'
cask 'mplayer-osx-extended'
cask 'opera'
cask 'signal'
cask 'slack'
cask 'stats'
cask 'steam'
cask 'spotify'
cask 'typora'
cask 'vivaldi'
cask 'visual-studio-code'
cask 'zoom'

